from abc import ABC
from typing import Final


class TgConfig(ABC):
    STATE: Final = {}
    CHANNEL_URL: Final = 'https://t.me/+DZbZXngTtCUxYzll'
    HELPER_URL: Final = '@yourhatefulldeath'
    GROUP_ID: Final = -4824955713
    REFERRAL_PERCENT = 0
    PAYMENT_TIME: Final = 1800
    RULES: Final = """

Совершая покупку, вы автоматически принимаете условия данной оферты. 

1. Тех поддержка в праве отказать в обслуживании, в перезакладе, выдаче скидки, на своё усмотрение без каких-либо объяснений причин. 
2. Все комиссии денежных переводов на покупателе.
3. Ненаход рассматривается от 10 покупок и более!
4. Запрещается передача клада третьим лицам.
5. Решение о пз рассматривается в течении 72 часов.  
6.Если вы выносите проблему на общую , то моментально лишаете себя право на перезаклад.

Если вы не можете найти клад, не стоит нервничать, вести себя агрессивно, внимательно изучите фото курьера, и попробуйте посмотреть лучше. 

Но если вы все таки не нашли клад, то действуйте строго по правилам: 


Откройте спор под покупкой и изложите свою проблему в одном сообщении!
1. Уточните время покупки и время прибытия на место.
2. Уточните сколько у вас удачных покупок.
3. Опишите свою мысль о случившиемся недоразумении.
4. Фото с места поисков. 3 чётких фото где видно что вы на месте и проводили поиски.  
5. Фотографии общего плана в разные стороны(для уточнения местности) 

*Для прикрепления фото воспользуйтесь любым фотохостингом
(например postimages.org).
*Вопросы о ненаходе не рассматриваются без фото.
*Пересылая фотографии с места клада, вы присылаете не аргументы ненахода, вы присылаете информацию для помощи в поисках клада а не доказываете отсутствие клада на месте. 

Важно помнить, что перезаклад это редкий случай, и если ваш вопрос взяли на рассмотрение, это еще не значит что будет перезаклад. У нас работают профессионалы своего дела. 
Но Вы всегда можете отправить свои претензии с фото,видео доказательствами. 

Вас много, а оператор один. Не надо спамить, вести себя грубо. Агрессивный стиль общения оставит вас с проблемой один на один.
    """
